app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Mon, 07 Apr 2014 14:17:09 UTC +00:00], ["updated_at", Mon, 07 Apr 2014 14:17:09 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Mon, 07 Apr 2014 14:17:09 UTC +00:00], ["product_id", 1], ["updated_at", Mon, 07 Apr 2014 14:17:09 UTC +00:00]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save