app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = 1  [["description", "Lorem ipsum Lorem ipsum Lorem ipsum Lorem ipsum Lorem ipsum "], ["price", #<BigDecimal:41316c0,'0.1E-1',9(18)>], ["updated_at", Mon, 07 Apr 2014 13:31:40 UTC +00:00]]